package.json

{
  "name": "express-gremlin-soap-demo",
  "version": "1.0.0",
  "private": true,
  "type": "module",
  "description": "Minimal Express + node-soap (WSDL-first) + Gremlin demo",
  "readme": "SOAP CreatePerson example (POST /soap)\n\n```xml\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:peo=\"urn:people:v1\">\n  <soapenv:Header/>\n  <soapenv:Body>\n    <peo:CreatePersonRequest>\n      <peo:name>Jane Doe</peo:name>\n      <peo:email>jane@example.com</peo:email>\n    </peo:CreatePersonRequest>\n  </soapenv:Body>\n</soapenv:Envelope>\n```\n",
  "scripts": {
    "build": "tsc -p tsconfig.json",
    "start": "node dist/server.js",
    "start:dev": "nodemon --watch src --ext ts,wsdl --exec \"ts-node --transpile-only src/server.ts\"",
    "docker:up": "docker compose up --build",
    "docker:down": "docker compose down -v"
  },
  "dependencies": {
    "dotenv": "^16.4.5",
    "express": "^4.19.2",
    "gremlin": "^3.7.2",
    "soap": "^1.0.0",
    "uuid": "^9.0.1"
  },
  "devDependencies": {
    "@types/express": "^4.17.21",
    "@types/gremlin": "^3.6.7",
    "@types/node": "^22.5.4",
    "@types/uuid": "^9.0.7",
    "nodemon": "^3.1.4",
    "ts-node": "^10.9.2",
    "typescript": "^5.6.2"
  }
}
